Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: རྡུལ་བྲལ་དང་། ནོར་བུ་བཟང་དང་། འོད་ཟེར་ཅན་དང་། ཤཱཀྱ་ཐུབ་པ་དང་། དབྱངས་ཀྱི་དབང་ཕྱུག་དང་། བདེ་འབྱུང་དང་། ཐུ་བོ་དང་། ཡང་དག་འབྱུང་དང་། མེ་ཏོག་དང་། ཡང་དག་མེ་ཏོག་དང་། མི་འཁྲུགས་པ་དང་། ཉི་མའི་སྙིང་པོ་དང་། དགའ་བའི་དབང་ཕྱུག་དང་། ཀླུས་བྱིན་དང་། རྡོ་རྗེའི་འོད་དང་། གྲགས་པའི་རྒྱལ་པོ་དང་། སྟག་གི་འོད་ཟེར་དང་། སྤྱོད་བཅས་དང་། ཡེ་ཤེས་འབྱུང་དང་། སྤོས་ཀྱི་དབང་ཕྱུག་དང་།
en: In the same way he prophesied the tathāgatas Sumana, Śailarāja, Saṃvṛtalocana, Brahmottara, Jambūcchāya, Pūrṇa, Uttara, Ratnaśaila, Samudragarbha, Nārāyaṇa, Śikhin, Kanakamuni, Munīndra, Kauṇḍinya, Siṃhavikrama, Jñānadhvaja, Buddhaśrava, Aparājita, Vikasitojjaya, Hiteṣin, Prajñāvabhāsa, Mahendra, Śāntaprajñākara, Nanda, Nyagrodharāja, Kanakalocana, Sahita, Sūryanandi, Ratnaśikhin, Sunetra, Brahma, Sunda, Brahmarṣabha, Praṇāda, Dharmacandra, Arthadarśin, Yaśonandin, Yaśottara, Abhirūpa, Sugandha, Catura, Pravaralocana, Sunijasta, Sārthavrata, Sumanoratha, Varaprajña, Kanakadhvaja, Sunetra, Devaśuddha, Śuddhodana, Sudarśana, Virūḍhadhvaja, Virūpākṣa, Brahmasvara, Śrīsaṃbhava, Śrīmahāviraja, Maṇibhadra, Mārīci, Śākyamuni, Ghoṣeśvara, Satyasaṃbhava, Śreṣṭha, Saṃbhavapuṣpa, Sukusuma, Akṣobhya, Sūryagarbha, Ratīśvara, Nāgadanta, Vajraprabhāsa, Kīrtirāja, Vyāghraraśmi, Sanetyajñānasaṃbhava, Gandheśvara, Sālendra, Nārāyaṇagarbha, and Jyotigarbha. “

source: སཱ་ལའི་དབང་པོ་དང་། སྲེད་མེད་ཀྱི་བུའི་སྙིང་པོ་དང་། སྐར་མའི་སྙིང་པོ་ཞེས་བྱ་བ་དག་ཏུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །རིགས་ཀྱི་བུ་དེ་ནས་མདུན་ན་འདོན་ཀྱི་བུ་ཐམས་ཅད་ཀྱི་ཐ་ཆུངས་འཇིགས་པའི་གདུང་བྲལ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྲམ་ཟེའི་ཁྱེའུ་བདུན་ཅུ་རྩ་དགུ་པོ་འདི་དག་ཐམས་ཅད་བསྐལ་པ་ཨུད་པ་ལ་ཡང་དག་རྟོག་གི་ཡང་སྐྱེ་བ་གཉིས་པ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Noble son, the youngest of the royal priest’s sons, who was named Vigatabhayasaṃtāpa, sat before the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, you have prophesied that all of these seventy-nine young brahmins will attain the complete enlightenment of perfect buddhahood in the second eon, the developed era of Utpalasaṃtīraṇa.

source: །ཞེས་ལུང་བསྟན་པ་ལགས་པས་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱི་སྟེ།
en: Bhadanta Bhagavat, I will also develop the motivation to attain the highest, most complete enlightenment.

source: བསྐལ་པ་ཨུད་པ་ལ་ཡང་དག་རྟོག་པས་པར་འགྱུར་བ་ན་ཐམས་ཅད་ཀྱི་ཐ་མར་བྱང་ཆུབ་མཆོག་ལ་རེག་པར་གྱུར་ཅིག །
en: May I be the very last to reach supreme enlightenment in the Utpalasaṃtīraṇa eon when it is coming to an end.

source: སངས་རྒྱས་བདུན་ཅུ་རྩ་དགུ་པོ་དེ་དག་གི་སྐུ་ཚེའི་ཚད་ཇི་ཙམ་པ་བདག་བྱང་ཆུབ་ཐོབ་པ་གཅིག་པུའི་ཚེའི་ཚད་ཀྱང་དེ་ཙམ་དུ་གྱུར་ཅིག །
en: Whatever is the lifespan of those seventy-nine buddhas, when I attain enlightenment, may I have a lifespan that is equal to the sum of all theirs.

source: དེ་དག་གི་འདུལ་བ་ཇི་སྙེད་མཆིས་པར་གྱུར་པ་དང་། ཇི་ལྟར་དེ་དག་ཐེག་པ་གསུམ་པོ་དག་གིས་ཆོས་སྟོན་པར་འགྱུར་བ་བདག་གཅིག་པུའི་ཡང་དེ་སྙེད་དུ་གྱུར་ཅིག །
en: May I alone have as many disciples as they all will have had, and may I give as many Dharma teachings through the three yānas as they all will.

source: ཇི་ལྟར་དེ་དག་གི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཇི་སྙེད་མཆིས་པར་འགྱུར་བ་བདག་བྱང་ཆུབ་ཐོབ་པ་གཅིག་པུའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དེ་སྙེད་དུ་གྱུར་ཅིག །
en: Having attained enlightenment, may I alone have in my saṅghas of disciples as many as all will have.

source: སངས་རྒྱས་བདུན་ཅུ་རྩ་དགུ་པོ་དེ་དག་བྱུང་བའི་བསྐལ་པ་ཨུད་པ་ལ་ཡང་དག་རྟོག་དེ་ལ་སེམས་ཅན་གང་དག་གིས་མིའི་ལུས་ཐོབ་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བསྐལ་པ་བས་པར་འགྱུར་བ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཐེག་པ་གསུམ་པོ་དག་གི་ངེས་པ་ལ་དགོད་པར་བགྱིའོ།
en: And when I have attained the complete enlightenment of perfect buddhahood as the eon is coming to an end, may I firmly establish in the three yānas all those beings who attained a human body during that Utpalasaṃtīraṇa eon when the seventy-nine other buddhas appeared.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ།
en: Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, then may the Bhadanta Bhagavat prophesy my highest, most complete enlightenment.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་འཇིགས་པའི་གདུང་བྲལ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Noble son, then the Tathāgata Ratnagarbha congratulated Vigatabhayasaṃtāpa, saying, ‘Well done, well done, good man!

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ལ་སྙིང་རྗེ་ཞིང་ཕན་པར་བྱེད་པར་ཞུགས་པ་ནི་ལེགས་སོ་ལེགས་སོ།
en: You have come forth as a compassionate benefactor for countless beings.

source: །བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཅིག་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་བསྐལ་པ་ཨུད་པ་ལ་ཡང་དག་རྟོག་དེ་ཟད་ཀར་ཐམས་ཅད་ཀྱི་ཐ་མར་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Young brahmin, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, when the Utpalasaṃtīraṇa eon is coming to an end, you will be the last to attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་རྡུལ་བྲལ་ཡང་དག་འཕགས་མངོན་འཕགས་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: You will become the tathāgata, and so on, up to and including the bhagavat buddha, named Vigata­raja­samudgatābhyudgata­rāja.

source: །ཇི་ལྟར་སངས་རྒྱས་བདུན་ཅུ་རྩ་དགུ་པོ་དེ་དག་གི་ཚེ་བསྐལ་པ་ཕྱེད་དུ་འགྱུར་བ་དེ་བཞིན་དུ་ཁྱོད་གཅིག་པུའི་ཡང་བསྐལ་པ་ཕྱེད་དུ་འགྱུར་ཏེ།
en: The lifespans of all seventy-nine buddhas together are equal to half an eon, and so you alone will live for half an eon.

source: ཇི་ལྟར་སྨོན་ལམ་བཏབ་པའི་སྨོན་ལམ་དེ་དག་ཐམས་ཅད་ཀྱི་བར་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་རོ། །དེས་གསོལ་པ།
en: Likewise, all those prayers of yours will be accomplished according to your aspiration.’ “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བ་དེའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་དུ་མེ་ཏོག་སྔོན་པོའི་ཆར་ཤིན་ཏུ་དྲི་བདའ་བ་དག་འབབ་པར་གྱུར་ཅིག །
en: Vigatabhayasaṃtāpa said, ‘Bhadanta Bhagavat, if my wish is to be completely fulfilled, when I bow down the five points of my body to the Bhagavat’s feet, may a rain of very fragrant blue flowers fall on this entire buddha realm.

source: སེམས་ཅན་གང་དག་གིས་དྲི་དེ་ཚོར་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཁམས་རྣམས་རབ་ཏུ་དང་ཞིང་མི་འཐུན་པ་མ་མཆིས་པར་གྱུར་ཅིག །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །
en: May the elements of all the beings who smell their fragrance become clear and unconflicted, and may all their illnesses become pacified.’ “

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་འཇིགས་པའི་གདུང་བྲལ་གྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དེའི་ཚེ་དེའི་དུས་ན་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐམས་ཅད་དུ་མེ་ཏོག་སྔོན་པོའི་ཆར་དག་ཀྱང་རབ་ཏུ་བབ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་དྲི་དེ་ཚོར་བར་གྱུར་ནས་དེ་དག་ཐམས་ཅད་ཀྱི་ཁམས་རྣམས་ཀྱང་སྙོམས་ཤིང་མི་འཐུན་པ་མེད་པར་གནས་པར་གྱུར། དེ་ན་སེམས་ཅན་ཐམས་ཅད་ལ་ནད་མེད་ཅིང་གནོད་པ་མེད་པར་གྱུར་པ་དང་།
en: Noble son, when the young brahmin Vigatabhayasaṃtāpa bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, a rain of blue flowers fell on this entire buddha realm, and the elements of all the beings who smelled their fragrance became balanced and in harmony, and all the beings there were without illness or injury. “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། སྙིང་རྗེའི་བརྟུལ་ཞུགས་དུལ་བའི་སེམས་ལོངས་ཤིག །
en: The Tathāgata Ratnagarbha said: “ ‘Rise up, you who have a mind tamed by the vow of compassion.

source: འཇིག་རྟེན་མགོན་པོ་མང་པོ་མཆོད་འགྱུར་ཞིང་། །ཉོན་མོངས་གཡོ་མདུད་དམ་པོ་གཅོད་འགྱུར་ཏེ། །དགེ་བ་དམ་པ་ཤེས་རབ་མཛོད་དུ་འགྱུར།། །།བམ་པོ་བརྒྱད་པ།
en: You will offer veneration to many lords of worlds, You will cut through the tight bondage of the deceitful kleśas, And you will become a treasure of good, perfect wisdom.’ “

source: རིགས་ཀྱི་བུ་བྲམ་ཟེའི་དེའི་སློབ་མ་བྱེ་བ་ཕྲག་གསུམ་ཀུན་དགའི་ར་བའི་སྒོ་ན་འདུག་པ་དེ་དག་གིས་ཀྱང་སེམས་ཅན་འོངས་པ་རྣམས་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ལ་བཀོད་ཅིང་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ།
en: Noble son, thirty million disciples of the brahmin were sitting at the gate of the park. They were giving refuge in the Three Jewels to those beings who arrived there and inspiring them to attain enlightenment. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་སློབ་མ་དེ་དག་ལ་སྨྲས་པ། ཀྱེ་བྲམ་ཟེའི་ཁྱེའུ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཇི་ལྟ་བུ་འདོད་པ་དག་ཀྱང་ལོང་ཤིག །
en: Noble son, then the brahmin Samudrareṇu addressed those disciples: ‘Dear young brahmins, you should develop the motivation to attain the highest, most complete enlightenment, and you should choose the array of buddha-realm qualities that you desire.

source: སྨོན་ལམ་ཇི་ལྟ་བུ་འདོད་པ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐོབ་ཤིག །
en: In the presence of the Bhagavat you should make the aspirational prayers that you wish to make.’ “

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྐར་མའི་ཁྱུ་མཆོག་གིས་སྨྲས་པ། ལམ་ཇི་ལྟ་བུ་དང་། ཚོགས་ཇི་ལྟ་བུ་དང་། སྤྱོད་པ་ཇི་ལྟ་བུ་དང་། རྗེས་སུ་དྲན་པ་ཇི་ལྟ་བུས་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་ལགས།
en: Then the brahmin youth named Radiant Bull asked, ‘Through which path, through which accumulation, through which conduct, and through which mindfulness is enlightenment attained?’ “ ‘

source: མདུན་ན་འདོན་གྱིས་སྨྲས་པ། བྲམ་ཟེའི་ཁྱེའུ་བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔས་མི་ཟད་པའི་མཛོད་བཞི་པོ་འདི་དག་ཡང་དག་པར་བསྒྲུབ་པར་བྱ་སྟེ།
en: Young brahmin,’ replied the royal priest, ‘the bodhisattva who follows the path to enlightenment accomplishes it through four inexhaustible treasures.

source: བསོད་ནམས་ཀྱི་ཚོགས་མི་ཟད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་མི་ཟད་པ་དང་། ཤེས་རབ་ཀྱི་ཚོགས་མི་ཟད་པ་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྒྲུབ་པའི་ཚོགས་མི་ཟད་པ་སྟེ།
en: They are the inexhaustible accumulation of merit, the inexhaustible accumulation of knowledge, the inexhaustible accumulation of wisdom, and the inexhaustible accumulation of the true accomplishment of all Dharma teachings.

source: རིགས་ཀྱི་བུ་ལམ་དེ་ནི་དེ་ལྟ་བུ་ཡིན་ནོ།
en: Noble son, such is the path. “ ‘

source: །བྲམ་ཟེའི་ཁྱེའུ་དེ་བཞིན་གཤེགས་པས་ཀྱང་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཚོགས་རྣམ་པར་དག་པ་སྡུད་པ་ཞེས་བྱ་བ་ཚོགས་ཉམས་སུ་ལེན་པར་བྱེད་པ། ཆོས་ཀྱི་སྒོ་སྦྱིན་པའི་ཚོགས་ཡོངས་སུ་གཏོང་བར་བྱེད་དེ། དེས་ནི་འདུལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: And, young brahmin, the Tathāgata has taught that the bodhisattva practice of accumulation is called gathering the pure accumulations: The accumulation of generosity is to give completely the Dharma entranceways and thereby ripen those beings who are to be guided.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ནི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of correct conduct completely fulfills their aspirational prayers.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟོད་པའི་ཚོགས་ནི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of patience completely perfects for them the major and secondary physical signs.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཚོགས་ནི་དགོས་པ་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of diligence enables them to accomplish all that is necessary.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཚོགས་ནི་ཅང་ཤེས་ཀྱི་སེམས་སུ་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of meditation elevates their minds.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཚོགས་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of wisdom gives them the complete knowledge of all kleśas.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐོས་པའི་ཚོགས་ནི་སྤོབས་པ་ཐོགས་པ་མེད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of learning makes them have unimpeded eloquence.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of merit enables them to care for all beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཚོགས་ནི་ཤེས་པ་ཐོགས་པ་མེད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of knowledge gives them unimpeded knowledge.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཞི་གནས་ཀྱི་ཚོགས་ནི་སེམས་ལས་སུ་རུང་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of śamatha makes their minds workable.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལྷག་མཐོང་གི་ཚོགས་ནི་ཐེ་ཙོམ་དང་བྲལ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of vipaśyanā liberates them from uncertainty.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པའི་ཚོགས་ནི་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of kindness makes their minds free of hostility.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེའི་ཚོགས་ནི་འདུལ་བ་ལ་མི་སྐྱོ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of compassion causes them to never weary of guiding beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགའ་བའི་ཚོགས་ནི་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་མོས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of rejoicing causes them to delight in the joy of the Dharma.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཏང་སྙོམས་ཀྱི་ཚོགས་ནི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of equanimity causes them to forsake attachment and aversion.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཉན་པའི་ཚོགས་ནི་སྒྲིབ་པ་སྤོང་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of listening to the Dharma causes the elimination of their obscurations.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་འབྱུང་བའི་ཚོགས་ནི་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་སྤོང་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of renunciation causes them to relinquish all possessiveness.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགོན་པར་གནས་པའི་ཚོགས་ནི་དགེ་བའི་ལས་བྱས་པ་ཆུད་མི་ཟ་བར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of dwelling in solitude prevents wasting the good actions they have done.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བ་སྤེལ་བ་སྒོམ་པའི་ཚོགས་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of meditating on the increase of goodness creates all good roots.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པའི་ཚོགས་ནི་གཟུངས་ཐོབ་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of recollection causes the attainment of the power of mental retention.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བློ་གྲོས་ཀྱི་ཚོགས་ནི་བློའི་བྱེ་བྲག་འབྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of intelligence distinguishes between the aspects of the mind.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མོས་པའི་ཚོགས་ནི་དོན་གྱི་རྣམ་པའི་རྗེས་སུ་རྟོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of aspiration brings realization of meaning.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པ་ཉེ་བར་གཞག་པའི་ཚོགས་ནི་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་། ཆོས་ལ་སོ་སོར་རྟོག་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of mindfulness develops attention to the body, sensation, mind, and phenomena.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡང་དག་པའི་སྤོང་བའི་ཚོགས་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of correct elimination perfects meditation on good qualities.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཚོགས་ནི་ལུས་དང་། སེམས་ཡང་བ་ཉིད་དུ་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the bases of miraculous powers creates lightness of body and mind.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབང་པོའི་ཚོགས་ནི་སྡོམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of powers accomplishes the fulfillment of vows.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ཀྱི་ཚོགས་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་འཇོམས་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of strengths accomplishes the defeat of all the kleśas.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་ནི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱེད་པར་འགྱུར་རོ།
en: The bodhisattvas’ accumulation of the factors for enlightenment accomplishes the comprehension of the nature of phenomena.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་པོར་བྱེད་པ་དྲུག་གི་ཚོགས་ནི་འདུལ་བའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་དག་པར་བྱེད་པར་འགྱུར་རོ་ཞེས་གསུངས་ཏེ།
en: The bodhisattvas’ accumulation of the six essential matters accomplishes the purification of those they are guiding.

source: བྲམ་ཟེའི་ཁྱེའུ་ཚོགས་རྣམ་པར་དག་པ་སྡུད་པ་ཞེས་བྱ་བ་དེ་ནི་ཚོགས་ཉམས་སུ་ལོན་པར་བྱེད་པའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །དེས་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཀྱིས་སྦྱིན་པའི་ཚོགས་ནི་ལོངས་སྤྱོད་ཆེན་པོ་དང་། གཡོག་འཁོར་མང་པོར་འགྱུར་བར་གསུངས་ལ།
en: This, young brahmin, is the Dharma entranceway for transcending saṃsāra called gathering the pure accumulations.’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚུལ་ཁྲིམས་ནི་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། ཐོས་པས་ནི་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་དང་། དད་པ་དང་། འཚོ་བ་དང་། སྒོམ་པ་ནི་འཁོར་བ་ལས་རྒལ་བར་བྱེད་པར་བསྟན་ཏོ། །མདུན་ན་འདོན་གྱིས་སྨྲས་པ་དང་། བྲམ་ཟེའི་ཁྱེའུ་གང་དག་འཁོར་བ་ལ་མངོན་པར་དགའ་བ་རྣམས་ནི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དེ།
en: The young brahmin Radiant Bull said, ‘The Bhagavat has taught that the accumulation of generosity leads to having great wealth and a great retinue, that correct conduct leads to rebirth in higher existences, that listening to the Dharma leads to having great wisdom, and the Bhagavat has taught that faith, right livelihood, and meditation leads to transcendence from saṃsāra.’ “ ‘

source: བྲམ་ཟེའི་ཁྱེའུ་དེ་ཡང་འདི་སྐད་དུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་བྱང་ཆུབ་ཀྱི་ལམ་ལ་ཞུགས་པ་དེ་དག་གིས་ནི་དུལ་བའི་སེམས་ཀྱིས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །ཞི་གནས་ཀྱི་སེམས་ཀྱིས་ཚུལ་ཁྲིམས་བསྲུང་བར་བྱའོ། །རྙོག་པ་མེད་པའི་སེམས་ཀྱིས་ཐོས་པ་ཡོངས་སུ་བཙལ་བར་བྱའོ། །སྙིང་རྗེ་ཆེན་པོའི་སེམས་ཀྱིས་བསྒོམ་པ་བསྒོམ་པར་བྱའོ།
en: Young brahmin,’ replied the royal priest, ‘those who, taking pleasure in saṃsāra, practice generosity, should do as has been taught: Young brahmin, those noble sons or noble daughters who have entered the path to enlightenment should practice generosity with a tamed mind; with a stable mind they should maintain correct conduct, with an unpolluted mind they should strive to listen to the Dharma, and with a mind of great compassion they should practice meditation.

source: །ཆོས་ལྷག་མ་རྣམས་ཀྱང་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་། ཐབས་ཀྱི་ཚོགས་ཡང་དག་པར་བསྒྲུབ་པའི་ཕྱིར་ཡོངས་སུ་བཙལ་བར་བྱའོ་ཞེས་གསུངས་པ་ལྟ་བུ་སྟེ།
en: They should search for the other teachings as well in order to accomplish the accumulations of wisdom, knowledge, and method.’ “ ‘

source: བྲམ་ཟེའི་ཁྱེའུ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ཡིན་ནོ།
en: This, young brahmin, is the path to enlightenment.

source: །ཚོགས་དེ་ལྟ་བུས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་ཏེ།
en: Through such accumulation, enlightenment is attained.

source: བྲམ་ཟེའི་ཁྱེའུ་བསྒོམ་པ་ནི་དེ་ལྟ་བུ་ཡིན། དྲན་པ་ནི་དེ་ལྟ་བུ་ཡིན། བྱང་ཆུབ་ཀྱི་ལམ་གྱི་སྤྱོད་པ་ནི་དེ་ལྟ་བུ་ཡིན་གྱིས།
en: Young brahmin, such is meditation, such is mindfulness, such is the conduct of the path to enlightenment.

source: བྲམ་ཟེའི་ཁྱེའུ་བྱང་ཆུབ་ཏུ་འདུན་པ་སྐྱེད་ཅིག །
en: Young brahmin, develop the aspiration for enlightenment.

source: བྲམ་ཟེའི་ཁྱེའུ་བྱང་ཆུབ་ཀྱི་ལམ་ནི་ཡང་དག་པ་ཡིན་གྱིས་བསམ་པ་ཐག་པ་ནས་སྨོན་ལམ་ཐོབ་ཤིག་དང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Young brahmin, the path to enlightenment is pure, because should you make an aspirational prayer with sincerity, it will be fulfilled.

source: །བྲམ་ཟེའི་ཁྱེའུ་བསམ་པ་ཐག་པས་བྱང་ཆུབ་ཀྱི་ལམ་ནི་དང་བ་ཡིན་ནོ།
en: Young brahmin, the path to enlightenment is serene, because of the purity of thoughts.

source: །བྲམ་ཟེའི་ཁྱེའུ་གཡོ་མེད་པས་རྣམ་པར་དག་པ་སྟེ། ཉོན་མོངས་པ་རབ་ཏུ་བསལ་བས་བྱང་ཆུབ་ཀྱི་ལམ་ནི་དྲང་བ་ཡིན་ནོ།
en: Young brahmin, the path to enlightenment is upright, because it is completely clear of deception and because it removes the kleśas.

source: །བྲམ་ཟེའི་ཁྱེའུ་བླ་ན་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་མཐར་ཐུག་པས་བྱང་ཆུབ་ཀྱི་ལམ་ནི་གྲུབ་པ་དང་།
en: Young brahmin, the path to enlightenment is secure, because its consummation is unsurpassable nirvāṇa.

source: བདེ་བ་ཡིན་གྱིས་སྨོན་ལམ་ཐོབ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་དག་པའམ། ཡོངས་སུ་མ་དག་པ་ཇི་ལྟ་བུ་འདོད་པ་ལོང་ཤིག །
en: Young brahmin, make an aspirational prayer and choose a buddha realm’s array of qualities that is either pure or impure, as you desire.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྐར་མའི་ཁྱུ་མཆོག་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་འདུག་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱི་སྟེ། སེམས་ཅན་འདོད་ཆགས་ཆུང་བ་རྣམས་དང་། ཞེ་སྡང་ཆུང་བ་རྣམས་དང་། གཏི་མུག་ཆུང་བ་རྣམས་དང་། སེམས་འཁྲུལ་པ་མ་མཆིས་ཤིང་མ་འཁྲུལ་པ་རྣམས་དང་། འཁོན་པའི་སེམས་མ་མཆིས་པ་རྣམས་དང་། ཕྲག་དོག་དང་སེར་སྣའི་སེམས་རྣམ་པར་སྤངས་པ་རྣམས་དང་།
en: Then, noble son, the young brahmin Radiant Bull knelt on his right knee before the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, I too will develop the aspiration for the highest, most complete enlightenment.

source: ལོག་པར་ལྟ་བའི་སེམས་ཡོངས་སུ་སྤངས་པ་རྣམས་དང་། ཡང་དག་པའི་ལྟ་བའི་སེམས་ལ་གནས་པ་རྣམས་དང་། དགེ་བར་སེམས་པ་རྣམས་དང་། དགེ་བ་ཡོངས་སུ་ཚོལ་བར་སེམས་པ་རྣམས་དང་། ངན་སོང་གསུམ་གྱི་ལམ་རྣམ་པར་སྤོང་བར་སེམས་པ་རྣམས་དང་། མཐོ་རིས་ཀྱི་ལམ་གསུམ་ལ་བརྩོན་པར་སེམས་པ་རྣམས་དང་། བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་གིས་དགེ་བའི་རྩ་བ་ཡང་དག་པར་སྡུད་པ་རྣམས་དང་། ཐེག་པ་གསུམ་པོ་དག་ལ་བརྩོན་པར་སེམས་པ་རྣམས་ཀྱི་སླད་དུ་བདག་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་འདིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: May I attain the complete enlightenment of perfect buddhahood in this afflicted buddha realm for the sake of beings with little desire, with little anger, with little ignorance, whose minds are not confused, whose minds are without enmity, whose minds are without envy and greed, whose minds are without wrong views, whose minds are established in correct views, whose minds are virtuous, whose minds are dedicated to virtue, whose minds have shunned the paths to the three lower existences, whose minds are dedicated to the paths of the three higher existences, who accumulate good roots through the three activities that create merit, and whose minds are dedicated to the three yānas.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་བདག་གི་སུག་པ་ལག་པ་གཉིས་སུ་གླང་པོ་ཆེའི་གཙོ་བོ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, if my wishes are to be completely fulfilled, may the lords of elephants appear on my two hands.’ “

source: ཚིག་དེ་སྐད་ཅེས་སྨྲས་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་དེའི་ལག་པ་གཉིས་སུ་གླང་པོ་ཆེའི་གཙོ་བོ་ཐལ་ཀར་ཡན་ལག་བདུན་ཤིན་ཏུ་གནས་པ་དག་བྱུང་བར་གྱུར་པ་མཐོང་ནས།
en: As soon as he said those words, through the power of the Bhagavat, white seven-limbed lords of elephants appeared on his two hands.

source: དེས་སྨྲས་པ། ཁྱེད་ཅག་ཆུང་ཟད་ཙམ་ཞིག་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་སྟེང་གི་ནམ་མཁའ་ལ་དེང་ལ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆར་ཤིན་ཏུ་དྲི་ཞིམ་པ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སེམས་ཅན་ཐམས་ཅད་སད་པར་གྱིས་ཤིག །དེའི་ཐིགས་པས་སེམས་ཅན་གང་དག་གི་ལུས་ལ་ཕོག་གམ།
en: He saw them and said to them, ‘Go up into the sky above this entire buddha realm and awaken all beings from this buddha realm with rain that is perfectly fragrant and is formed of water with the eight excellent qualities.

source: གང་དག་གིས་དྲི་ཚོར་བར་གྱུར་པ་དེ་དག་གི་སྒྲིབ་པ་ལྔ་སྤངས་པར་གྱུར་ཅིག །འདི་ལྟ་སྟེ། འདོད་པ་ལ་འདུན་པའི་སྒྲིབ་པ་སྤངས་པར་གྱུར་ཅིག །གནོད་སེམས་དང་། རྨུགས་པ་དང་། གཉིད་དང་།
en: May the beings whose bodies are touched by its drops or who smell its fragrance be freed from the five obscurations, that is, may they be freed from the obscuration of taking pleasure in desire and may they be freed from the obscurations of malice, lethargy and sleepiness, agitation and regret, and doubt.’ “
